"====================================Кортеж==================================="
# tuple- неизменяемый, интерируемый индексируемый и упорядоченый тип данный,
# предназначеный для хранения элементов в строгом порядке!(Занимает меньше памяти потому что не изменяемый)

tuple1 = (1,2,3,4,5)
tuple2 = (5)  # int 
tuple3 = 1,2,3,4,5  # tuple
tuple4 = 5,     #tuple (5,)

tuple5 = (1, "hello", [1,2,3])
tuple5[-1].append(5)  # (1, "hello", [1,2,3,5])

tuple6 = tuple("hello")
# (h,e,l,l,o)

"===================================Методы Tuple================================="
# count - считает количество данного элемента в tuple
tuple1 = (1,2,1,4,5,1,6)
print(tuple1.count(1)) #3


# index - возвращает индекс данного элемента.
tuple1 =("hello", "world", 105)